Revit 2024 API
FabricSheet.IsUnobscuredInView Method
 Checks if this fabric sheet is shown unobscured in a view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool IsUnobscuredInView(
	View view
)
Visual Basic
Public Function IsUnobscuredInView ( _
	view As View _
) As Boolean
Visual C++
public:
bool IsUnobscuredInView(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view element
Return Value
 True if fabric sheet is shown unobscured, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  This fabric sheet doesn't have valid visibility data.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace